<a href="https://colab.research.google.com/github/Hruthikaveldi/23CSBTB29/blob/main/Part3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Part 3 â€“ Access Data from Various Data Sources using builtin Function of Numpy, Pandas[CO3]**

In [ ]:
import pandas as pd
data=pd.read_excel("/content/Excel work book.xlsx")
print(data)

     SID      NAME  AGE  COURSE     CONTACT
0   1543  HRUTHIKA   19  B Tech  8328015334
1   1038    PRANAV   18  B Tech  9676249100
2   1560   ANURATH   19  B Tech  8885299732
3   1918      RUPA   19  B Tech  8688784288
4   1886   SPURTHI   18  B Tech  8806399206
5   1027    ANJALI   18  B Tech  6281806866
6   1363    VARSHA   19  B Tech  9502511960
7   1365   RITHIKA   18  B Tech  6301143258
8   2810   HARIENN   17  B Tech  9669312345
9   1810   PRAVEEN   20  B Tech  8008052222
10  3982   RADHIKA   20  B Tech  7799832229
11  1234      RYAN   19  B Tech  8635184599
12  1542     RADHA   18  B Tech  7527094208
13  1324     ARNAV   20  B Tech  8359149294
14  2314   HRITHIK   18  B Tech  7927184909
15  1853    AYUSHH   19  B Tech  7629542002
16  1345    DEEPAK   18  B Tech  9914771092
17  1964   KARTHIK   18  B Tech  7738296912
18  1742   ADITHYA   20  B Tech  9922447729
19  1853    GEORGE   19  B Tech  8002185419

In [ ]:
import pandas as pd
data = pd.read_csv("/content/Excel work book.csv")
print(data)

     SID      NAME  AGE  COURSE     CONTACT
0   1543  HRUTHIKA   19  B Tech  8328015334
1   1038    PRANAV   18  B Tech  9676249100
2   1560   ANURATH   19  B Tech  8885299732
3   1918      RUPA   19  B Tech  8688784288
4   1886   SPURTHI   18  B Tech  8806399206
5   1027    ANJALI   18  B Tech  6281806866
6   1363    VARSHA   19  B Tech  9502511960
7   1365   RITHIKA   18  B Tech  6301143258
8   2810   HARIENN   17  B Tech  9669312345
9   1810   PRAVEEN   20  B Tech  8008052222
10  3982   RADHIKA   20  B Tech  7799832229
11  1234      RYAN   19  B Tech  8635184599
12  1542     RADHA   18  B Tech  7527094208
13  1324     ARNAV   20  B Tech  8359149294
14  2314   HRITHIK   18  B Tech  7927184909
15  1853    AYUSHH   19  B Tech  7629542002
16  1345    DEEPAK   18  B Tech  9914771092
17  1964   KARTHIK   18  B Tech  7738296912
18  1742   ADITHYA   20  B Tech  9922447729
19  1853    GEORGE   19  B Tech  8002185419

In [ ]:
import pandas as pd
data = pd.read_table("/content/Excel work book.txt")
print(data)

     SID      NAME  AGE  COURSE     CONTACT
0   1543  HRUTHIKA   19  B Tech  8328015334
1   1038    PRANAV   18  B Tech  9676249100
2   1560   ANURATH   19  B Tech  8885299732
3   1918      RUPA   19  B Tech  8688784288
4   1886   SPURTHI   18  B Tech  8806399206
5   1027    ANJALI   18  B Tech  6281806866
6   1363    VARSHA   19  B Tech  9502511960
7   1365   RITHIKA   18  B Tech  6301143258
8   2810   HARIENN   17  B Tech  9669312345
9   1810   PRAVEEN   20  B Tech  8008052222
10  3982   RADHIKA   20  B Tech  7799832229
11  1234      RYAN   19  B Tech  8635184599
12  1542     RADHA   18  B Tech  7527094208
13  1324     ARNAV   20  B Tech  8359149294
14  2314   HRITHIK   18  B Tech  7927184909
15  1853    AYUSHH   19  B Tech  7629542002
16  1345    DEEPAK   18  B Tech  9914771092
17  1964   KARTHIK   18  B Tech  7738296912
18  1742   ADITHYA   20  B Tech  9922447729
19  1853    GEORGE   19  B Tech  8002185419

In [ ]:
import pandas as pd
data = pd.read_csv("heart.csv")
print(data)

      age  sex  cp  trestbps  chol  fbs  restecg  thalach  exang  oldpeak  \
0      52    1   0       125   212    0        1      168      0      1.0
1      53    1   0       140   203    1        0      155      1      3.1
2      70    1   0       145   174    0        1      125      1      2.6
3      61    1   0       148   203    0        1      161      0      0.0
4      62    0   0       138   294    1        1      106      0      1.9
...   ...  ...  ..       ...   ...  ...      ...      ...    ...      ...
1020   59    1   1       140   221    0        1      164      1      0.0
1021   60    1   0       125   258    0        0      141      1      2.8
1022   47    1   0       110   275    0        0      118      1      1.0
1023   50    0   0       110   254    0        0      159      0      0.0
1024   54    1   0       120   188    0        1      113      0      1.4

      slope  ca  thal  target
0         2   2     3       0
1         0   0     3       0
2         0   0     3       0
3         2   1     3       0
4         1   3     2       0
...     ...  ..   ...     ...
1020      2   0     2       1
1021      1   1     3       0
1022      1   1     2       0
1023      2   0     2       1
1024      1   1     3       0

[1025 rows x 14 columns]

In [ ]:
import pandas as pd
data = pd.read_csv("games_dataset.csv")
print(data)

                                    Game Name       Genre         Platform  \
0                   Sekiro: Shadows Die Twice      Sports  Nintendo Switch
1                                     Control      Puzzle  Nintendo Switch
2                                    Among Us    Strategy  Nintendo Switch
3                Call of Duty: Modern Warfare     Stealth      PlayStation
4                           League of Legends  Simulation               PC
...                                       ...         ...              ...
4995  The Legend of Zelda: Breath of the Wild      Sports               PC
4996                Assassin's Creed Valhalla     Stealth           Mobile
4997             Fall Guys: Ultimate Knockout      Sports           Mobile
4998                            Borderlands 3  Platformer             Xbox
4999         Counter-Strike: Global Offensive      Action      PlayStation

      Release Year  User Rating
0             2014     9.654719
1             2000     3.457386
2             2007     5.367622
3             2005     1.240325
4             2021     3.535476
...            ...          ...
4995          2013     6.352838
4996          2020     1.852730
4997          2021     5.268067
4998          2018     4.558510
4999          2022     3.443231

[5000 rows x 5 columns]